### 📋 Terraform Plan: `aws/dfbx/eu-south-2/labs/hands-on-datadog/vpc`

✅ **Plan Status:** Success
⚠️ **Format Check:** Failed (non-blocking)

<details><summary>📄 Plan Output</summary>

```terraform
[0;90m22:03:53.625[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform used the selected providers to generate the following execution
[0;90m22:03:53.625[0m [0;37mSTDOUT[0m [0;36mterraform: [0mplan. Resource actions are indicated with the following symbols:
[0;90m22:03:53.625[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + create
[0;90m22:03:53.625[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m22:03:53.625[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_default_network_acl.this[0] will be created
[0;90m22:03:53.626[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_default_network_acl" "this" {
[0;90m22:03:53.626[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                    = (known after apply)
[0;90m22:03:53.626[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + default_network_acl_id = (known after apply)
[0;90m22:03:53.626[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                     = (known after apply)
[0;90m22:03:53.626[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner_id               = (known after apply)
[0;90m22:03:53.626[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region                 = "eu-south-2"
[0;90m22:03:53.626[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                   = {
[0;90m22:03:53.626[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-default"
[0;90m22:03:53.626[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.626[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.626[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.626[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.626[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.626[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.626[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.626[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.626[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all               = {
[0;90m22:03:53.626[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-default"
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id                 = (known after apply)
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + egress {
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + action          = "allow"
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + from_port       = 0
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + ipv6_cidr_block = "::/0"
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + protocol        = "-1"
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + rule_no         = 101
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + to_port         = 0
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (1 unchanged attribute hidden)
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + egress {
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + action          = "allow"
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + cidr_block      = "0.0.0.0/0"
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + from_port       = 0
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + protocol        = "-1"
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + rule_no         = 100
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + to_port         = 0
[0;90m22:03:53.627[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (1 unchanged attribute hidden)
[0;90m22:03:53.628[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.628[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ingress {
[0;90m22:03:53.628[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + action          = "allow"
[0;90m22:03:53.628[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + from_port       = 0
[0;90m22:03:53.628[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + ipv6_cidr_block = "::/0"
[0;90m22:03:53.628[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + protocol        = "-1"
[0;90m22:03:53.628[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + rule_no         = 101
[0;90m22:03:53.628[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + to_port         = 0
[0;90m22:03:53.628[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (1 unchanged attribute hidden)
[0;90m22:03:53.628[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.628[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ingress {
[0;90m22:03:53.628[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + action          = "allow"
[0;90m22:03:53.628[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + cidr_block      = "0.0.0.0/0"
[0;90m22:03:53.628[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + from_port       = 0
[0;90m22:03:53.628[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + protocol        = "-1"
[0;90m22:03:53.628[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + rule_no         = 100
[0;90m22:03:53.628[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + to_port         = 0
[0;90m22:03:53.628[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (1 unchanged attribute hidden)
[0;90m22:03:53.628[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.628[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:03:53.628[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_default_route_table.default[0] will be created
[0;90m22:03:53.629[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_default_route_table" "default" {
[0;90m22:03:53.630[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                    = (known after apply)
[0;90m22:03:53.630[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + default_route_table_id = (known after apply)
[0;90m22:03:53.631[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                     = (known after apply)
[0;90m22:03:53.631[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner_id               = (known after apply)
[0;90m22:03:53.631[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region                 = "eu-south-2"
[0;90m22:03:53.632[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + route                  = (known after apply)
[0;90m22:03:53.632[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                   = {
[0;90m22:03:53.633[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-default"
[0;90m22:03:53.633[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.633[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.633[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.633[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.633[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.633[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.633[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.633[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.633[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all               = {
[0;90m22:03:53.633[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-default"
[0;90m22:03:53.634[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.634[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m22:03:53.634[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.634[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.634[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.634[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.634[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.634[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.634[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.634[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id                 = (known after apply)
[0;90m22:03:53.635[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + timeouts {
[0;90m22:03:53.637[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + create = "5m"
[0;90m22:03:53.637[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + update = "5m"
[0;90m22:03:53.637[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.637[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:03:53.637[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_default_security_group.this[0] will be created
[0;90m22:03:53.637[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_default_security_group" "this" {
[0;90m22:03:53.637[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                    = (known after apply)
[0;90m22:03:53.637[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + description            = (known after apply)
[0;90m22:03:53.637[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + egress                 = (known after apply)
[0;90m22:03:53.637[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                     = (known after apply)
[0;90m22:03:53.637[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ingress                = (known after apply)
[0;90m22:03:53.637[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name                   = (known after apply)
[0;90m22:03:53.637[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix            = (known after apply)
[0;90m22:03:53.638[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner_id               = (known after apply)
[0;90m22:03:53.638[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region                 = "eu-south-2"
[0;90m22:03:53.638[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + revoke_rules_on_delete = false
[0;90m22:03:53.638[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                   = {
[0;90m22:03:53.638[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-default"
[0;90m22:03:53.638[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.638[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.638[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.638[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.639[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.639[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.639[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.639[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.639[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all               = {
[0;90m22:03:53.639[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-default"
[0;90m22:03:53.639[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.639[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m22:03:53.639[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.639[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.639[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.639[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.639[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.639[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.640[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.640[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id                 = (known after apply)
[0;90m22:03:53.640[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:03:53.640[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_eip.nat[0] will be created
[0;90m22:03:53.640[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_eip" "nat" {
[0;90m22:03:53.640[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + allocation_id        = (known after apply)
[0;90m22:03:53.640[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                  = (known after apply)
[0;90m22:03:53.640[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + association_id       = (known after apply)
[0;90m22:03:53.640[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + carrier_ip           = (known after apply)
[0;90m22:03:53.640[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + customer_owned_ip    = (known after apply)
[0;90m22:03:53.640[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + domain               = "vpc"
[0;90m22:03:53.640[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                   = (known after apply)
[0;90m22:03:53.641[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + instance             = (known after apply)
[0;90m22:03:53.641[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipam_pool_id         = (known after apply)
[0;90m22:03:53.641[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + network_border_group = (known after apply)
[0;90m22:03:53.641[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + network_interface    = (known after apply)
[0;90m22:03:53.641[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + private_dns          = (known after apply)
[0;90m22:03:53.641[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + private_ip           = (known after apply)
[0;90m22:03:53.641[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ptr_record           = (known after apply)
[0;90m22:03:53.641[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + public_dns           = (known after apply)
[0;90m22:03:53.641[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + public_ip            = (known after apply)
[0;90m22:03:53.641[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + public_ipv4_pool     = (known after apply)
[0;90m22:03:53.641[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region               = "eu-south-2"
[0;90m22:03:53.641[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                 = {
[0;90m22:03:53.641[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-eu-south-2a"
[0;90m22:03:53.641[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.641[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.641[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.641[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.641[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.642[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.644[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.644[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.644[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all             = {
[0;90m22:03:53.644[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-eu-south-2a"
[0;90m22:03:53.644[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.644[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m22:03:53.644[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.644[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.644[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.644[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.644[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.644[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.644[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.645[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:03:53.645[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_internet_gateway.this[0] will be created
[0;90m22:03:53.645[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_internet_gateway" "this" {
[0;90m22:03:53.645[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn      = (known after apply)
[0;90m22:03:53.645[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id       = (known after apply)
[0;90m22:03:53.645[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner_id = (known after apply)
[0;90m22:03:53.645[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region   = "eu-south-2"
[0;90m22:03:53.645[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags     = {
[0;90m22:03:53.645[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2"
[0;90m22:03:53.645[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.645[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.645[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.645[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.645[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.645[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.646[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.646[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.646[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all = {
[0;90m22:03:53.646[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2"
[0;90m22:03:53.646[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.646[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m22:03:53.646[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.646[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.646[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.646[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.646[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.646[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.646[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.646[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id   = (known after apply)
[0;90m22:03:53.646[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:03:53.646[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_nat_gateway.this[0] will be created
[0;90m22:03:53.646[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_nat_gateway" "this" {
[0;90m22:03:53.647[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + allocation_id                      = (known after apply)
[0;90m22:03:53.647[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + association_id                     = (known after apply)
[0;90m22:03:53.647[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + auto_provision_zones               = (known after apply)
[0;90m22:03:53.647[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + auto_scaling_ips                   = (known after apply)
[0;90m22:03:53.647[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + availability_mode                  = (known after apply)
[0;90m22:03:53.648[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + connectivity_type                  = "public"
[0;90m22:03:53.648[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                                 = (known after apply)
[0;90m22:03:53.648[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + network_interface_id               = (known after apply)
[0;90m22:03:53.648[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + private_ip                         = (known after apply)
[0;90m22:03:53.648[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + public_ip                          = (known after apply)
[0;90m22:03:53.648[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region                             = "eu-south-2"
[0;90m22:03:53.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + regional_nat_gateway_address       = (known after apply)
[0;90m22:03:53.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + regional_nat_gateway_auto_mode     = (known after apply)
[0;90m22:03:53.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + route_table_id                     = (known after apply)
[0;90m22:03:53.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + secondary_allocation_ids           = (known after apply)
[0;90m22:03:53.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + secondary_private_ip_address_count = (known after apply)
[0;90m22:03:53.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + secondary_private_ip_addresses     = (known after apply)
[0;90m22:03:53.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + subnet_id                          = (known after apply)
[0;90m22:03:53.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                               = {
[0;90m22:03:53.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-eu-south-2a"
[0;90m22:03:53.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                           = {
[0;90m22:03:53.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-eu-south-2a"
[0;90m22:03:53.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m22:03:53.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id                             = (known after apply)
[0;90m22:03:53.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:03:53.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route.private_nat_gateway[0] will be created
[0;90m22:03:53.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_route" "private_nat_gateway" {
[0;90m22:03:53.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + destination_cidr_block = "0.0.0.0/0"
[0;90m22:03:53.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                     = (known after apply)
[0;90m22:03:53.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + instance_id            = (known after apply)
[0;90m22:03:53.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + instance_owner_id      = (known after apply)
[0;90m22:03:53.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + nat_gateway_id         = (known after apply)
[0;90m22:03:53.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + network_interface_id   = (known after apply)
[0;90m22:03:53.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + origin                 = (known after apply)
[0;90m22:03:53.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region                 = "eu-south-2"
[0;90m22:03:53.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + route_table_id         = (known after apply)
[0;90m22:03:53.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + state                  = (known after apply)
[0;90m22:03:53.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + timeouts {
[0;90m22:03:53.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + create = "5m"
[0;90m22:03:53.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:03:53.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route.public_internet_gateway[0] will be created
[0;90m22:03:53.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_route" "public_internet_gateway" {
[0;90m22:03:53.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + destination_cidr_block = "0.0.0.0/0"
[0;90m22:03:53.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + gateway_id             = (known after apply)
[0;90m22:03:53.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                     = (known after apply)
[0;90m22:03:53.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + instance_id            = (known after apply)
[0;90m22:03:53.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + instance_owner_id      = (known after apply)
[0;90m22:03:53.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + network_interface_id   = (known after apply)
[0;90m22:03:53.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + origin                 = (known after apply)
[0;90m22:03:53.652[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region                 = "eu-south-2"
[0;90m22:03:53.652[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + route_table_id         = (known after apply)
[0;90m22:03:53.652[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + state                  = (known after apply)
[0;90m22:03:53.652[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + timeouts {
[0;90m22:03:53.652[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + create = "5m"
[0;90m22:03:53.652[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.652[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:03:53.652[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route_table.private[0] will be created
[0;90m22:03:53.652[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_route_table" "private" {
[0;90m22:03:53.652[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn              = (known after apply)
[0;90m22:03:53.652[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id               = (known after apply)
[0;90m22:03:53.652[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner_id         = (known after apply)
[0;90m22:03:53.652[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + propagating_vgws = (known after apply)
[0;90m22:03:53.652[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region           = "eu-south-2"
[0;90m22:03:53.652[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + route            = (known after apply)
[0;90m22:03:53.652[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags             = {
[0;90m22:03:53.652[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-private"
[0;90m22:03:53.653[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.653[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.653[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.653[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.653[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.653[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.653[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.653[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.653[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all         = {
[0;90m22:03:53.653[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-private"
[0;90m22:03:53.653[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.653[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m22:03:53.653[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.653[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.653[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.653[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.653[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.654[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.654[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.654[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id           = (known after apply)
[0;90m22:03:53.654[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:03:53.654[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route_table.public[0] will be created
[0;90m22:03:53.654[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_route_table" "public" {
[0;90m22:03:53.654[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn              = (known after apply)
[0;90m22:03:53.654[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id               = (known after apply)
[0;90m22:03:53.654[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner_id         = (known after apply)
[0;90m22:03:53.654[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + propagating_vgws = (known after apply)
[0;90m22:03:53.654[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region           = "eu-south-2"
[0;90m22:03:53.654[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + route            = (known after apply)
[0;90m22:03:53.654[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags             = {
[0;90m22:03:53.654[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-public"
[0;90m22:03:53.654[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.654[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.655[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.655[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.655[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.655[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.655[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.655[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.655[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all         = {
[0;90m22:03:53.655[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-public"
[0;90m22:03:53.655[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.655[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m22:03:53.655[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.655[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.655[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.655[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.655[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id           = (known after apply)
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route_table_association.private[0] will be created
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_route_table_association" "private" {
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id             = (known after apply)
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region         = "eu-south-2"
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + route_table_id = (known after apply)
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + subnet_id      = (known after apply)
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route_table_association.private[1] will be created
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_route_table_association" "private" {
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id             = (known after apply)
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region         = "eu-south-2"
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + route_table_id = (known after apply)
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + subnet_id      = (known after apply)
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route_table_association.public[0] will be created
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_route_table_association" "public" {
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id             = (known after apply)
[0;90m22:03:53.656[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region         = "eu-south-2"
[0;90m22:03:53.657[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + route_table_id = (known after apply)
[0;90m22:03:53.657[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + subnet_id      = (known after apply)
[0;90m22:03:53.657[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:03:53.657[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route_table_association.public[1] will be created
[0;90m22:03:53.657[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_route_table_association" "public" {
[0;90m22:03:53.657[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id             = (known after apply)
[0;90m22:03:53.657[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region         = "eu-south-2"
[0;90m22:03:53.657[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + route_table_id = (known after apply)
[0;90m22:03:53.657[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + subnet_id      = (known after apply)
[0;90m22:03:53.657[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:03:53.657[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_subnet.private[0] will be created
[0;90m22:03:53.657[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_subnet" "private" {
[0;90m22:03:53.657[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                                            = (known after apply)
[0;90m22:03:53.657[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + assign_ipv6_address_on_creation                = false
[0;90m22:03:53.657[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + availability_zone                              = "eu-south-2a"
[0;90m22:03:53.658[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + availability_zone_id                           = (known after apply)
[0;90m22:03:53.658[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cidr_block                                     = "10.99.1.0/24"
[0;90m22:03:53.658[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_dns64                                   = false
[0;90m22:03:53.658[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_resource_name_dns_a_record_on_launch    = false
[0;90m22:03:53.658[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_resource_name_dns_aaaa_record_on_launch = false
[0;90m22:03:53.658[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                                             = (known after apply)
[0;90m22:03:53.658[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_cidr_block                                = (known after apply)
[0;90m22:03:53.658[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_cidr_block_association_id                 = (known after apply)
[0;90m22:03:53.658[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_native                                    = false
[0;90m22:03:53.658[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + map_public_ip_on_launch                        = false
[0;90m22:03:53.658[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner_id                                       = (known after apply)
[0;90m22:03:53.658[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + private_dns_hostname_type_on_launch            = (known after apply)
[0;90m22:03:53.659[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region                                         = "eu-south-2"
[0;90m22:03:53.659[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                                           = {
[0;90m22:03:53.659[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-private-eu-south-2a"
[0;90m22:03:53.659[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.659[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.659[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.659[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.659[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.659[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.659[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.659[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.659[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                                       = {
[0;90m22:03:53.659[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-private-eu-south-2a"
[0;90m22:03:53.659[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.659[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m22:03:53.659[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.659[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.659[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.660[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.660[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.660[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.660[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.660[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id                                         = (known after apply)
[0;90m22:03:53.660[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:03:53.660[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_subnet.private[1] will be created
[0;90m22:03:53.660[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_subnet" "private" {
[0;90m22:03:53.660[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                                            = (known after apply)
[0;90m22:03:53.660[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + assign_ipv6_address_on_creation                = false
[0;90m22:03:53.660[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + availability_zone                              = "eu-south-2b"
[0;90m22:03:53.661[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + availability_zone_id                           = (known after apply)
[0;90m22:03:53.661[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cidr_block                                     = "10.99.2.0/24"
[0;90m22:03:53.661[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_dns64                                   = false
[0;90m22:03:53.661[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_resource_name_dns_a_record_on_launch    = false
[0;90m22:03:53.661[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_resource_name_dns_aaaa_record_on_launch = false
[0;90m22:03:53.661[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                                             = (known after apply)
[0;90m22:03:53.661[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_cidr_block                                = (known after apply)
[0;90m22:03:53.661[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_cidr_block_association_id                 = (known after apply)
[0;90m22:03:53.661[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_native                                    = false
[0;90m22:03:53.661[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + map_public_ip_on_launch                        = false
[0;90m22:03:53.662[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner_id                                       = (known after apply)
[0;90m22:03:53.662[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + private_dns_hostname_type_on_launch            = (known after apply)
[0;90m22:03:53.662[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region                                         = "eu-south-2"
[0;90m22:03:53.662[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                                           = {
[0;90m22:03:53.662[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-private-eu-south-2b"
[0;90m22:03:53.662[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.662[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.662[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.662[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.662[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.662[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.662[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.662[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.662[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                                       = {
[0;90m22:03:53.662[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-private-eu-south-2b"
[0;90m22:03:53.662[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.662[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m22:03:53.663[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.663[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.663[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.663[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.663[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.663[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.663[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.663[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id                                         = (known after apply)
[0;90m22:03:53.663[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:03:53.663[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_subnet.public[0] will be created
[0;90m22:03:53.663[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_subnet" "public" {
[0;90m22:03:53.663[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                                            = (known after apply)
[0;90m22:03:53.663[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + assign_ipv6_address_on_creation                = false
[0;90m22:03:53.663[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + availability_zone                              = "eu-south-2a"
[0;90m22:03:53.663[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + availability_zone_id                           = (known after apply)
[0;90m22:03:53.663[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cidr_block                                     = "10.99.101.0/24"
[0;90m22:03:53.663[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_dns64                                   = false
[0;90m22:03:53.664[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_resource_name_dns_a_record_on_launch    = false
[0;90m22:03:53.664[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_resource_name_dns_aaaa_record_on_launch = false
[0;90m22:03:53.664[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                                             = (known after apply)
[0;90m22:03:53.664[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_cidr_block                                = (known after apply)
[0;90m22:03:53.664[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_cidr_block_association_id                 = (known after apply)
[0;90m22:03:53.664[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_native                                    = false
[0;90m22:03:53.664[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + map_public_ip_on_launch                        = false
[0;90m22:03:53.664[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner_id                                       = (known after apply)
[0;90m22:03:53.664[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + private_dns_hostname_type_on_launch            = (known after apply)
[0;90m22:03:53.664[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region                                         = "eu-south-2"
[0;90m22:03:53.664[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                                           = {
[0;90m22:03:53.664[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-public-eu-south-2a"
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                                       = {
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-public-eu-south-2a"
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id                                         = (known after apply)
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_subnet.public[1] will be created
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_subnet" "public" {
[0;90m22:03:53.665[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                                            = (known after apply)
[0;90m22:03:53.666[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + assign_ipv6_address_on_creation                = false
[0;90m22:03:53.666[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + availability_zone                              = "eu-south-2b"
[0;90m22:03:53.666[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + availability_zone_id                           = (known after apply)
[0;90m22:03:53.666[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cidr_block                                     = "10.99.102.0/24"
[0;90m22:03:53.666[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_dns64                                   = false
[0;90m22:03:53.666[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_resource_name_dns_a_record_on_launch    = false
[0;90m22:03:53.666[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_resource_name_dns_aaaa_record_on_launch = false
[0;90m22:03:53.666[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                                             = (known after apply)
[0;90m22:03:53.666[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_cidr_block                                = (known after apply)
[0;90m22:03:53.666[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_cidr_block_association_id                 = (known after apply)
[0;90m22:03:53.666[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_native                                    = false
[0;90m22:03:53.667[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + map_public_ip_on_launch                        = false
[0;90m22:03:53.667[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner_id                                       = (known after apply)
[0;90m22:03:53.667[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + private_dns_hostname_type_on_launch            = (known after apply)
[0;90m22:03:53.667[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region                                         = "eu-south-2"
[0;90m22:03:53.667[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                                           = {
[0;90m22:03:53.667[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-public-eu-south-2b"
[0;90m22:03:53.667[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.667[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.667[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.667[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.667[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.667[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.667[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.667[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.667[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                                       = {
[0;90m22:03:53.668[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "vpc-hands-on-datadog-eu-south-2-public-eu-south-2b"
[0;90m22:03:53.668[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:03:53.668[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m22:03:53.668[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:03:53.668[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:03:53.668[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:03:53.668[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:03:53.668[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:03:53.668[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:03:53.668[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:03:53.668[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id                                         = (known after apply)
[0;90m22:03:53.668[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:03:53.668[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_vpc.this[0] will be created
[0;90m22:03:53.668[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_vpc" "this" {
[0;90m22:03:53.668[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                                  = (known after apply)
[0;90m22:03:53.668[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cidr_block                           = "10.99.0.0/16"
[0;90m22:03:53.668[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + default_network_acl_id               = (known after apply)
[0;90m22:03:53.669[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + default_route_table_id               = (known after 

... (truncated)
```
</details>

---
*Workflow: [Terragrunt Plan IaC](https://github.com/darthfabax-org/iac/actions/runs/22644784193)*